title: Relevant Anti-Virus Signature Keywords In Application Log
id: 78bc5783-81d9-4d73-ac97-59f6db4f72a8
status: test
description: Detects potentially highly relevant antivirus events in the application log based on known virus signature names and malware keywords.
references:
  - https://www.virustotal.com/gui/file/13828b390d5f58b002e808c2c4f02fdd920e236cc8015480fa33b6c1a9300e31
  - https://www.virustotal.com/gui/file/15b57c1b68cd6ce3c161042e0f3be9f32d78151fe95461eedc59a79fc222c7ed
  - https://www.virustotal.com/gui/file/5092b2672b4cb87a8dd1c2e6047b487b95995ad8ed5e9fc217f46b8bfb1b8c01
author: Florian Roth (Nextron Systems), Arnim Rupp
date: 2017/02/19
modified: 2023/11/22
tags:
  - attack.resource_development
  - attack.t1588
logsource:
  product: windows
  service: application
detection:
  keywords:
    - 'Adfind'
    - 'ASP/BackDoor'
    - 'ATK/'
  filter_a:
    Level: 4
  filter_b:
    Name: 'sigma'
  filter_c:
    Sex: 'man'
  d:
    Age: 19
  condition: not d and (keywords and (filter_a and filter_b or filter_c) )
#  condition: keywords and not filter_a
falsepositives:
  - Some software piracy tools (key generators, cracks) are classified as hack tools
level: high
