title: Relevant Anti-Virus Signature Keywords In Application Log
id: 78bc5783-81d9-4d73-ac97-59f6db4f72a8
status: test
description: Detects potentially highly relevant antivirus events in the application log based on known virus signature names and malware keywords.
references:
  - https://www.virustotal.com/gui/file/13828b390d5f58b002e808c2c4f02fdd920e236cc8015480fa33b6c1a9300e31
  - https://www.virustotal.com/gui/file/15b57c1b68cd6ce3c161042e0f3be9f32d78151fe95461eedc59a79fc222c7ed
  - https://www.virustotal.com/gui/file/5092b2672b4cb87a8dd1c2e6047b487b95995ad8ed5e9fc217f46b8bfb1b8c01
author: Florian Roth (Nextron Systems), Arnim Rupp
date: 2017/02/19
modified: 2023/11/22
tags:
  - attack.resource_development
  - attack.t1588
logsource:
  product: windows
  service: application
detection:
  keywords:
    - 'Adfind'
    - 'ASP/BackDoor'
    - 'ATK/'
  filter_optional_generic:
    - 'Keygen'
    - 'Crack'
    - 'anti_ransomware_service.exe'
    - 'cyber-protect-service.exe'
  filter_optional_information1:
    Level1: 1
    Level2: 2
  filter_optional_information2:
    - name1: 'name1'
    - name2: 'name2'
  filter_optional_information3:
    name1: 'name1'
    Level:
      - 1
      - 2
      - 3
  other:
    name: 'other'
  dns:
    dns: 'baidu.com'
  http:
    http: 'http.com'
  # condition: keywords and (not 1 of filter_optional_* or (other and not http)) and dns
  condition: (keywords and not 1 of filter_optional_* or dns) or (other and not http) and dns
  # condition: keywords and dns
  # condition: keywords
  # condition: all of filter_optional_*
falsepositives:
  - Some software piracy tools (key generators, cracks) are classified as hack tools
level: high
